# -*- coding: utf-8 -*-

problem_banks = [
        'АКБ "Авангард" - ПАО',
        'АО "Кредит Европа Банк"',
        'АО "ТИНЬКОФФ БАНК"',
        'АО "Юникредит Банк"',
        'БАНК ВТБ (ПАО)',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО "ЗАПСИБКОМБАНК"',
        'ПАО "МИНБАНК"',
        'ПАО "ПРОМСВЯЗЬБАНК"',
        'ПАО «БАНК УРАЛСИБ»',
        'ПАО АКБ "СВЯЗЬ-БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО КБ "УБРИР"',
        'Банк "Зенит" (ПАО)'
        ]

rtk_arm = [
        'АО «Райффайзенбанк»',
        'ПАО «Совкомбанк»',
        'РНКБ Банк (ПАО)',
        'ООО «Хоум Кредит энд Финанс Банк»',
        'ПАО "СКБ-БАНК"'
        ]

all_not_updated_banks = [
        'АКБ "Авангард" - ПАО',
        'АКБ ФОРА-БАНК АО',
        'ПАО "Московский областной банк"',
        'ПАО МОСКОВСКИЙ КРЕДИТНЫЙ БАНК',
        'ПАО КБ "УБРИР"',
        'ПАО "КРАСНОДАРСКИЙ КРАЕВОЙ ИНВЕСТИЦИОННЫЙ БАНК"',
        '"Газпромбанк" (АО)',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'АО "ТИНЬКОФФ БАНК"',
        'ПАО "ПРОМСВЯЗЬБАНК" ',
        'Киви Банк АО'
        ]

not_updated_banks = ['АО "ТИНЬКОФФ БАНК"']


updated_banks = [
        'АО «Райффайзенбанк»',
        '"Газпромбанк" (АО)',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО «Совкомбанк»',
        'АО «Альфа-Банк»',
        'РНКБ Банк (ПАО)',
        'ООО «Хоум Кредит энд Финанс Банк»',
        'ПАО "ПОЧТА БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО "ПРОМСВЯЗЬБАНК"',
        'БАНК ВТБ (ПАО)'
        ]

first_wave_banks = [
        'ПАО «АК БАРС» БАНК',
        'АО «Райффайзенбанк»',
        '"Газпромбанк" (АО)',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО «Совкомбанк»',
        'АО «Альфа-Банк»',
        'РНКБ БАНК (ПАО)',
        'ООО «Хоум Кредит энд Финанс Банк»',
        'ПАО "ПОЧТА БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО "СБЕРБАНК РОССИИ"',
        'ПАО "ПРОМСВЯЗЬБАНК"',
        'БАНК ВТБ (ПАО)',
        'АО "ТИНЬКОФФ БАНК"'
        ]

first_wave_banks1 = [
        'ПАО «АК БАРС» БАНК',
        'АО «Райффайзенбанк»',
        'АО Газпромбанк',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО «СОВКОМБАНК»',
        'Альфабанк',
        'РНКБ Банк (ПАО)',
        'Хоумкредитбанк',
        'ПАО «ПОЧТА БАНК»',
        'ПАО Банк «Финансовая Корпорация Открытие»',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО «ПРОМСВЯЗЬБАНК»',
        'БАНК ВТБ (ПАО)',
        'АО «ТИНЬКОФФ БАНК»'
        ]

sec_wave_banks1 = [
        'АО «Юникредит Банк»',
        'АКБ «Авангард» - ПАО',
        'АО «ОТП БАНК»',
        'АО «Банк Русский Стандарт»',
        'ПАО «БАНК УРАЛСИБ»',
        'АКБ «АБСОЛЮТ БАНК» (ПАО)',
        'ПАО КБ «Центр-инвест»',
        'ПАО «МИНБАНК»',
        'АО «Кредит Европа Банк»',
        'ПАО «МосОблБанк»',
        'ПАО КБ «УБРИР»',
        'АКЦИОНЕРНОЕ ОБЩЕСТВО БАНК "СЕВЕРНЫЙ МОРСКОЙ ПУТЬ"',
        'ПАО Банк «Возрождение»',
        'ПАО «Банк «Санкт-Петербург»',
        'ПАО «МТС-БАНК»',
        'ПАО «ЗАПСИБКОМБАНК»',
        'Банк «Зенит» (ПАО)',
        'КБ «РЕНЕССАНС КРЕДИТ»  ООО',
        'АО «Акционерный Банк "Россия»',
        'ПАО АКБ "СВЯЗЬ-БАНК"',
        'ПАО МОСКОВСКИЙ КРЕДИТНЫЙ БАНК',
        'АКЦИОНЕРНОЕ ОБЩЕСТВО «ВСЕРОССИЙСКИЙ БАНК РАЗВИТИЯ РЕГИОНОВ»'
        ]

fw_cb_banks1 = [
        'ПАО «АК БАРС» БАНК',
        'АО «Райффайзенбанк»',
        'АО Газпромбанк',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО «СОВКОМБАНК»',
        'Альфабанк',
        'РНКБ Банк (ПАО)',
        'Хоумкредитбанк',
        'ПАО «ПОЧТА БАНК»',
        'ПАО Банк «Финансовая Корпорация Открытие»',
        'ПАО «ПРОМСВЯЗЬБАНК»',
        'БАНК ВТБ (ПАО)',
        ]

sec_wave_banks = [
        'АО "Юникредит Банк"',
        'АКБ "Авангард" - ПАО',
        'АО "ОТП БАНК"',
        'АО «Банк Русский Стандарт»',
        'ПАО "БАНК УРАЛСИБ"',
        'АКБ "АБСОЛЮТ БАНК" (ПАО)',
        'ПАО КБ "Центр-инвест"',
        'ПАО "МИНБАНК"',
        'АО "Кредит Европа Банк"',
        'ПАО "Московский областной банк"',
        'ПАО КБ "УБРИР"',
        'АКЦИОНЕРНОЕ ОБЩЕСТВО БАНК "СЕВЕРНЫЙ МОРСКОЙ ПУТЬ"',
        'ПАО Банк "Возрождение"',
        'ПАО «БАНК «САНКТ-ПЕТЕРБУРГ»',
        'ПАО "МТС-БАНК"',
        'ПАО "ЗАПСИБКОМБАНК"',
        'Банк "Зенит" (ПАО)',
        'КОММЕРЧЕСКИЙ БАНК "РЕНЕССАНС КРЕДИТ" (ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ)',
        'АО "Акционерный Банк "Россия"',
        'ПАО АКБ "СВЯЗЬ-БАНК"',
        'ПАО МОСКОВСКИЙ КРЕДИТНЫЙ БАНК',
        'ВОСТОЧНЫЙ???',
        'АКЦИОНЕРНОЕ ОБЩЕСТВО "ВСЕРОССИЙСКИЙ БАНК РАЗВИТИЯ РЕГИОНОВ"'
        ]

fw_cb_banks = [
        'ПАО «АК БАРС» БАНК',
        'АО «Райффайзенбанк»',
        '"Газпромбанк" (АО)',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО «Совкомбанк»',
        'АО «Альфа-Банк»',
        'РНКБ Банк (ПАО)',
        'ООО «Хоум Кредит энд Финанс Банк»',
        'ПАО "ПОЧТА БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО "ПРОМСВЯЗЬБАНК"',
        'БАНК ВТБ (ПАО)'
        ]
