# -*- coding: utf-8 -*-

problem_banks = [
        'АКБ "Авангард" - ПАО',
        'АО "Кредит Европа Банк"',
        'АО "ТИНЬКОФФ БАНК"',
        'АО "Юникредит Банк"',
        'БАНК ВТБ (ПАО)',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО "ЗАПСИБКОМБАНК"',
        'ПАО "МИНБАНК"',
        'ПАО "ПРОМСВЯЗЬБАНК"',
        'ПАО «БАНК УРАЛСИБ»',
        'ПАО АКБ "СВЯЗЬ-БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО КБ "УБРИР"',
        'Банк "Зенит" (ПАО)'
        ]

rtk_arm = [
        'АО «Райффайзенбанк»',
        'ПАО "СОВКОМБАНК"',
        'РНКБ Банк (ПАО)',
        'Хоумкредитбанк',
        'ПАО "СКБ-БАНК"'
        ]

all_not_updated_banks = [
        'АКБ "Авангард" - ПАО',
        'АКБ "Фора-Банк" (АО)',
        'ПАО "МосОблБанк"',
        '№№№МКБ№№№№',
        'ПАО КБ "УБРИР"',
        'ПАО "Краснодарский краевой инвестиционный банк"',
        'АО Газпромбанк',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'АО "ТИНЬКОФФ БАНК"',
        'ПАО "ПРОМСВЯЗЬБАНК" ',
        '##QIWI###'
        ]

not_updated_banks = ['АО "ТИНЬКОФФ БАНК"']


updated_banks = [
        'АО «Райффайзенбанк»',
        'АО Газпромбанк',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО "СОВКОМБАНК"',
        'Альфабанк',
        'РНКБ Банк (ПАО)',
        'Хоумкредитбанк',
        'ПАО "ПОЧТА БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО "ПРОМСВЯЗЬБАНК" ',
        'БАНК ВТБ (ПАО)'
        ]

first_wave_banks = [
        'ПАО «АК БАРС» БАНК',
        'АО «Райффайзенбанк»',
        'АО Газпромбанк',
        'ПАО РОСБАНК',
        'ПАО "СКБ-БАНК"',
        'ПАО "СОВКОМБАНК"',
        'Альфабанк',
        'РНКБ Банк (ПАО)',
        'Хоумкредитбанк',
        'ПАО "ПОЧТА БАНК"',
        'ПАО Банк "Финансовая Корпорация Открытие"',
        'ПАО  "СБЕРБАНК РОССИИ"',
        'ПАО "ПРОМСВЯЗЬБАНК" ',
        'БАНК ВТБ (ПАО)',
        'АО "ТИНЬКОФФ БАНК"',
        ''
        ]
sec_wave_banks = [
        'АО "Юникредит Банк"',
        'АКБ "Авангард" - ПАО',
        'АО "ОТП-БАНК"',
        'АО «Банк Русский Стандарт»',
        'ПАО «БАНК УРАЛСИБ»',
        'АКБ "АБСОЛЮТ БАНК" (ПАО)',
        'ПАО КБ "Центр-инвест"',
        'ПАО "МИНБАНК"',
        'АО "Кредит Европа Банк"',
        'ПАО "МосОблБанк"',
        'ПАО КБ "УБРИР"',
        'АКЦИОНЕРНОЕ ОБЩЕСТВО БАНК "СЕВЕРНЫЙ МОРСКОЙ ПУТЬ"',
        'ПАО Банк "Возрождение"',
        'ПАО «Банк «Санкт-Петербург»',
        'ПАО "МТС-БАНК"',
        'ПАО "ЗАПСИБКОМБАНК"',
        'Банк "Зенит" (ПАО)',
        'КБ "РЕНЕССАНС КРЕДИТ"  ООО',
        'АО "Акционерный Банк "Россия"',
        'ПАО АКБ "СВЯЗЬ-БАНК"',
        'ПАО МОСКОВСКИЙ КРЕДИТНЫЙ БАНК',
        'ВОСТОЧНЫЙ???',
        'ВБРР??'
        ]
